In [36]:
import pandas as pd

In [9]:
titanic_train=pd.read_csv(r"C:\Users\Aman\Downloads\train.csv")

In [11]:
titanic_train.head()

   PassengerId  Survived  Pclass  ...     Fare Cabin  Embarked
0            1         0       3  ...   7.2500   NaN         S
1            2         1       1  ...  71.2833   C85         C
2            3         1       3  ...   7.9250   NaN         S
3            4         1       1  ...  53.1000  C123         S
4            5         0       3  ...   8.0500   NaN         S

[5 rows x 12 columns]

In [12]:
titanic_train.tail()

     PassengerId  Survived  Pclass                                      Name  ...      Ticket   Fare  Cabin  Embarked
886          887         0       2                     Montvila, Rev. Juozas  ...      211536  13.00    NaN         S
887          888         1       1              Graham, Miss. Margaret Edith  ...      112053  30.00    B42         S
888          889         0       3  Johnston, Miss. Catherine Helen "Carrie"  ...  W./C. 6607  23.45    NaN         S
889          890         1       1                     Behr, Mr. Karl Howell  ...      111369  30.00   C148         C
890          891         0       3                       Dooley, Mr. Patrick  ...      370376   7.75    NaN         Q

[5 rows x 12 columns]

In [13]:
titanic_train.dtypes

PassengerId      int64
Survived         int64
Pclass           int64
Name            object
Sex             object
Age            float64
SibSp            int64
Parch            int64
Ticket          object
Fare           float64
Cabin           object
Embarked        object
dtype: object

In [14]:
titanic_train['PassengerId'].astype('object')

0        1
1        2
2        3
3        4
4        5
      ...
886    887
887    888
888    889
889    890
890    891
Name: PassengerId, Length: 891, dtype: object

In [18]:
titanic_train.dtypes=='object'

PassengerId    False
Survived       False
Pclass         False
Name            True
Sex             True
Age            False
SibSp          False
Parch          False
Ticket          True
Fare           False
Cabin           True
Embarked        True
dtype: bool